<?php

return [
    'account-overview' => 'ਖਾਤਾ ਝਲਕ',
    'twofactor-messagebox' => 'ਤੁਹਾਡੇ ਖਾਤੇ ਵਿੱਚ ਦੋ-ਫੈਕਟਰ ਪ੍ਰਮਾਣੀਕਰਣ ਸਮਰੱਥ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ ਤਾਂ ਕਿ ਤੁਸੀਂ ਜਾਰੀ ਰੱਖ ਸਕੋ.',
    'apikey' => 'API ਕੀ',
    'sshkey' => 'SSH ਕੀ',

    'update-password' => [
        'current' => 'ਮੌਜੂਦਾ ਪਾਸਵਰਡ',
        'new' => 'ਨਵਾਂ ਪਾਸਵਰਡ',
        'requirements' => 'ਤੁਹਾਡਾ ਨਵਾਂ ਪਾਸਵਰਡ ਘੱਟੋ-ਘੱਟ 8 ਅੱਖਰਾਂ ਦੀ ਲੰਬਾਈ ਦਾ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ ਅਤੇ ਇਸ ਵੈੱਬਸਾਈਟ ਲਈ ਇਕਮੋਤੀ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ.',
        'confirm' => 'ਨਵਾਂ ਪਾਸਵਰਡ ਪੁਸ਼ਟੀ ਕਰੋ',
        'update' => 'ਪਾਸਵਰਡ ਅੱਪਡੇਟ ਕਰੋ',
    ],

    'update-email' => [
        'isUpdated' => 'ਤੁਹਾਡਾ ਮੁੱਖ ਈਮੇਲ ਅੱਪਡੇਟ ਕੀਤਾ ਗਿਆ ਹੈ',
        'update' => 'ਈਮੇਲ ਅੱਪਡੇਟ ਕਰੋ',
        'email' => 'ਈਮੇਲ',
        'confirm' => 'ਪਾਸਵਰਡ ਪੁਸ਼ਟੀ ਕਰੋ',
    ],

    'appearance' => [
        'title' => 'ਦਿਖਾਵਟ',
        'lightDarkMode' => 'ਰੋਸ਼ਨੀ / ਅੰਧਰਾ ਮੋਡ',
        'light' => 'ਰੋਸ਼ਨੀ',
        'dark' => 'ਅੰਧਰਾ',
        'language' => 'ਪੈਨਲ ਭਾਸ਼ਾ',
        'panel-sounds' => 'ਪੈਨਲ ਧੁਨ',
        'on' => 'ਚਾਲੂ',
        'off' => 'ਬੰਦ',
    ],

    'twofactor' => [
        'title' => 'ਦੋ ਫੈਕਟਰ ਪ੍ਰਮਾਣੀਕਰਣ',
        'isEnabled' => 'ਤੁਹਾਡੇ ਖਾਤੇ ਤੇ ਹੱਲੇ ਦੋ ਪਗੜੀ ਦੀ ਪੁਸ਼ਟੀਕਰਣ ਚਾਲੂ ਹੈ.',
        'isDisabled' => 'ਤੁਹਾਡੇ ਖਾਤੇ ਤੇ ਹੱਲੇ ਦੋ ਪਗੜੀ ਦੀ ਪੁਸ਼ਟੀਕਰਣ ਚਾਲੂ ਨਹੀਂ ਹੈ. ਇਸ ਨੂੰ ਸੰਰਚਨਿਤ ਕਰਨ ਲਈ ਦਿੱਤੇ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰੋ.',
        'disable' => 'ਦੋ-ਪੈਸੇ ਬੰਦ ਕਰੋ',
        'enable' => 'ਦੋ-ਪੈਸੇ ਚਾਲੂ ਕਰੋ',
        
        'disable-dialog' => [
            'password' => 'ਪਾਸਵਰਡ',
            'cancel' => 'ਰੱਦ ਕਰੋ',
            'must-enter-password' => 'ਤੁਹਾਨੂੰ ਆਪਣਾ ਖਾਤਾ ਪਾਸਵਰਡ ਦਿਓਣਾ ਪਵੇਗਾ ਜਾਰੀ ਰੱਖਣ ਲਈ.',
            'disable' => 'ਬੰਦ ਕਰੋ',
        ],

        'setup-dialog' => [
            'description' => 'ਉੱਪਰ ਦਿੱਤੇ ਗਏ ਦੋ-ਪੈਸੇ ਪ੍ਰਮਾਣੀਕਰਣ ਐਪ ਦੀ ਮਦਦ ਨਾਲ ਕੋਡ ਸਕੈਨ ਕਰੋ. ਫਿਰ, ਹੇਠਾਂ ਦਿੱਤੇ ਗਏ ਫੀਲਡ ਵਿੱਚ ਜਨਰੇਟ ਕੀਤਾ ਗਿਆ 6-ਅੰਕੀ ਕੋਡ ਦਰਜ ਕਰੋ.',
            'account-password' => 'ਖਾਤਾ ਪਾਸਵਰਡ',
            'qrcode-loading' => 'QR ਕੋਡ ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...',
            'enter-6digit-password' => 'ਤੁਸੀਂ ਜਾਰੀ ਰੱਖਣ ਲਈ 6-ਅੰਕੀ ਕੋਡ ਅਤੇ ਆਪਣਾ ਪਾਸਵਰਡ ਦਰਜ ਕਰਨਾ ਪਵੇਗਾ.',
            'enable' => 'ਚਾਲੂ ਕਰੋ',
            'cancel' => 'ਰੱਦ ਕਰੋ',
        ],
    ],

    'apiKey' => [
        'label' => 'ਵੇਰਵਾ',
        'description' => 'ਇਸ API ਕੀ ਦਾ ਵੇਰਵਾ.',
        'allowedIPs-label' => 'ਮਨ੍ਹਾਂ ਆਈਪੀਆਂ',
        'allowedIPs-description' => 'ਇਸ API ਕੀ ਦੀ ਵਰਤੋਂ ਕਰਨ ਲਈ ਕਿਸੇ ਵੀ ਆਈਪੀ ਪਤਾ ਲਈ ਖਾਲੀ ਛੋਡੋ, ਅਗਰ ਨਹੀਂ, ਤਾਂ ਹਰ ਨਵਾਂ ਲਾਈਨ ਉੱਤੇ ਹਰ ਨਵੀਂ ਆਈਪੀ ਪਤਾ ਦਿਓ.',
        'createButton' => 'ਬਣਾਓ',

        'your-keys' => 'ਤੁਹਾਡੀ API ਕੀ',
        'store-save' => 'ਤੁਹਾਡੀ ਬੇਨਤੀ ਕੀਤੀ ਗਈ API ਕੀ ਹੇਠ ਦਿਖਾਈ ਜਾਂਦੀ ਹੈ. ਕਿਰਪਾ ਕਰਕੇ ਇਸ ਨੂੰ ਇੱਕ ਸੁਰੱਖਿਅਤ ਥਾਣੇ ਵਿੱਚ ਸਟੋਰ ਕਰੋ, ਇਹ ਫੇਰ ਨਹੀਂ ਦਿਖਾਇਆ ਜਾਵੇਗਾ.',
        'close' => 'ਬੰਦ ਕਰੋ',

        'delete-api-key' => 'API ਕੀ ਹਟਾਓ',
        'delete-key' => 'ਕੀ ਹਟਾਓ',
        'all-requests-invalidated-1' => 'ਸਭ ਦੇਵੇਆਂ',
        'all-requests-invalidated-2' => 'ਕੰਮ ਬਤੀ ਜਾਵੇਗਾ.',
        'loading' => 'ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...',
        'no-key-found' => 'ਇਸ ਖਾਤੇ ਲਈ ਕੋਈ API ਕੀ ਮੌਜੂਦ ਨਹੀਂ ਹੈ.',
        'last-used' => 'ਆਖਰੀ ਵਰਤੋਂ',
    ],

    'sshKey' => [
        'loading' => 'ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...',
        'no-key-found' => 'ਇਸ ਖਾਤੇ ਲਈ ਕੋਈ SSH ਕੀ ਮੌਜੂਦ ਨਹੀਂ ਹੈ.',
        'added-on' => 'ਸ਼ਾਮਲ ਕੀਤਾ ਗਿਆ',

        'createForm' => [
            'key-name' => 'SSH ਕੀ ਨਾਮ',
            'public-key' => 'ਪਬਲਿਕ ਕੀ',
            'public-key-desc' => 'ਆਪਣੀ ਪਬਲਿਕ SSH ਕੁੰਜੀ ਦਰਜ ਕਰੋ.',
            'save' => 'ਸੰਭਾਲੋ',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'SSH ਕੀ ਹਟਾਓ',
            'delete-key' => 'ਕੀ ਹਟਾਓ',
            'will-invalidate-1' => 'ਹਟਾਉਣ ਦੇ',
            'will-invalidate-2' => 'SSH ਕੁੰਜੀ ਨੂੰ ਪੈਨਲ ਦੇ ਵਰਤੋਂ ਨੂੰ ਨਾ-ਮਾਨਤਾ ਕਰੇਗਾ.',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'ਦੋ ਪੈਸੇ ਪ੍ਰਮਾਣੀਕਰਣ ਚਾਲੂ ਹੈ',
        'description' => 'ਹੇਠ ਦਿੱਤੇ ਗਏ ਕੋਡ ਨੂੰ ਕਿਸੇ ਸੁਰੱਖਿਅਤ ਸਥਾਨ ਤੇ ਸਟੋਰ ਕਰੋ. ਜੇ ਤੁਹਾਨੂੰ ਆਪਣੇ ਫੋਨ ਦੀ ਪਹੁੰਚ ਹਾਰ ਜਾਣਗੇ ਤਾਂ ਤੁਸੀਂ ਇਹ ਬੈਕਅੱਪ ਕੋਡ ਵਰਤ ਸਕਦੇ ਹੋ ਆਵੇਗਾ.',
        'alert' => 'ਇਹ ਕੋਡ ਇਸ ਤਰ੍ਹਾਂ ਦੋਬਾਰਾ ਨਹੀਂ ਦਿਖਾਏ ਜਾਣਗੇ.',
        'doneButton' => 'ਹੋ ਗਿਆ',
    ],
];
