<?php

return[
    'backups' => 'बैकअप',
    'manage-backups' => 'बैकअप प्रबंधित करें',
    'create-backup' => 'बैकअप बनाएँ',
    'have-been-allocated' => '{{current}} of {{max}} बैकअप इस सर्वर के लिए बनाए गए हैं।',

    'name' => 'नाम',
    'size' => 'आकार',
    'creation-date' => 'बनाने की तिथि',
    'checksum' => 'चेकसम',

    'failed' => 'असफल',
    'continue' => 'जारी रखें',

    'download' => 'डाउनलोड करें',
    'restore' => 'पुनर्स्थापित करें',
    'lock' => 'लॉक',
    'unlock' => 'अनलॉक',
    'delete' => 'हटाएँ',

    'limit-is-0' => 'इस सर्वर के लिए बैकअप नहीं बनाए जा सकते क्योंकि बैकअप सीमा 0 पर सेट है।',
    'try-going-back' => 'लगता है कि आपको बैकअप के साथ समस्या हुई है, एक पेज पीछे जाने की कोशिश करें।',
    'no-backups' => 'ऐसा लगता है कि इस सर्वर के लिए फिलहाल कोई बैकअप सहेजा नहीं गया है।',
    'no-longer-protected' => 'यह बैकअप अब स्वचालित या गलती से हटाए जाने से संरक्षित नहीं रहेगा।',
    'your-server-will-be-stopped' => 'आपका सर्वर रोक दिया जाएगा। आप पावर स्थिति नियंत्रित नहीं कर पाएँगे, फ़ाइल मैनेजर तक पहुँच नहीं होगी, या पूरा होने तक अतिरिक्त बैकअप नहीं बना पाएँगे।',
    'delete-all-files' => 'बैकअप पुनर्स्थापित करने से पहले सभी फ़ाइलें हटा दें।',
    'permanent-operation' => 'यह एक स्थायी क्रिया है। एक बार हटाए जाने के बाद बैकअप पुनः प्राप्त नहीं किया जा सकता।',

    'create' => [
        'title' => 'सर्वर बैकअप बनाएँ',
        'backup-name' => 'बैकअप नाम',
        'backup-name-description' => 'यदि प्रदान किया गया हो, वह नाम जिसका उपयोग इस बैकअप को संदर्भित करने के लिए किया जाना चाहिए।',
        'ignored-files-directories' => 'अनदेखी फ़ाइलें और डायरेक्टरी',
        'ignored-files-directories-description' => 'इस बैकअप को बनाते समय अनदेखा की जाने वाली फ़ाइलें या फ़ोल्डर दर्ज करें। यदि मौजूद हो, तो सर्वर डायरेक्टरी की रूट में .pteroignore फ़ाइल की सामग्री का उपयोग करने के लिए खाली छोड़ दें। फ़ाइलों और फ़ोल्डरों के लिए वाइल्डकार्ड मिलान का समर्थन है, साथ ही पथ के पहले विस्मयादिबोधक चिह्न लगाकर नियम को नकारने का भी।',
        'locked' => 'लॉक',
        'locked-description' => 'स्पष्ट रूप से अनलॉक किए जाने तक इस बैकअप को हटाए जाने से रोकता है।',
        'start' => 'बैकअप शुरू करें',
    ]
];
