return [
    'settings' => 'सेटिंग्स',

    'sftp' => [
        'title' => 'SFTP विवरण',
        'server-address' => 'सर्वर पता',
        'username' => 'उपयोगकर्ता नाम',
        'description' => 'आपका SFTP पासवर्ड वही है जो आप इस पैनल तक पहुँचने के लिए उपयोग करते हैं।',
        'launch-sftp' => 'SFTP शुरू करें',
    ],

    'rename' => [
        'title' => 'सर्वर विवरण बदलें',
        'server-name' => 'सर्वर नाम',
        'server-description' => 'सर्वर विवरण',
        'save' => 'सहेजें',
    ],

    'debug' => [
        'title' => 'डीबग जानकारी',
        'node' => 'नोड',
        'server-id' => 'सर्वर ID',
    ],

    'reinstall' => [
        'title' => 'सर्वर को पुनः इंस्टॉल करें',
        'reinstall-started' => 'आपके सर्वर का पुनः इंस्टॉलेशन शुरू हो गया है।',
        'confirm-reinstallation' => 'सर्वर पुनः इंस्टॉल करने की पुष्टि करें',
        'yes-reinstall' => 'हाँ, सर्वर पुनः इंस्टॉल करें',
        'are-you-sure' => 'आपका सर्वर रोका जाएगा और इस प्रक्रिया के दौरान कुछ फ़ाइलें हटाई या बदली जा सकती हैं, क्या आप वाकई जारी रखना चाहते हैं?',
        'desc-1' => 'सर्वर को पुनः इंस्टॉल करने से यह रुक जाएगा, और फिर वह इंस्टॉलेशन स्क्रिप्ट दोबारा चलेगी जिसने इसे शुरू किया था।',
        'desc-2' => 'इस प्रक्रिया के दौरान कुछ फ़ाइलें हटाई या बदली जा सकती हैं, कृपया आगे बढ़ने से पहले अपने डेटा का बैकअप ले लें।',
        'reinstall-server' => 'सर्वर पुनः इंस्टॉल करें',
    ],
];
