<?php

return [
    'title' => 'صارفین',
    'manage-subusers' => 'ذیلی صارفین کا منظم کریں',
    'new-user' => 'نیا صارف',

    'no-users' => 'یہ لگتا ہے کہ آپ کے پاس کوئی ذیلی صارف نہیں ہے۔',

    'name' => 'نام',
    'email' => 'ای میل',
    '2FA-enabled' => '2FA چالو ہے',
    'creation-date' => 'تخلیق کی تاریخ',
    'modify-permissions' => 'اختیارات میں ترتیب دیں',

    'user-email' => 'صارف کا ای میل',
    'user-email-description' => 'اس سرور کے لیے ذیلی صارف کے طور پر دعوت بھیجنا چاہتے ہیں، توصاف دینے والے صارف کا ای میل ڈالیں۔',

    'modify-permissions-for' => 'اختیارات میں ترتیب دینا',
    'view-permissions-for' => 'اختیارات دیکھیں',
    'create-new-subuser' => 'نیا ذیلی صارف بنائیں',
    'must-not-exceed' => 'ای میل کا پتہ 191 حروف سے زیادہ نہیں ہونا چاہئے۔',
    'valid-email' => 'ایک درست ای میل پتہ فراہم کیا جانا چاہئے۔',
    'save' => 'محفوظ کریں',
    'invite-user' => 'صارف کو دعوت دیں',

    'only-permissions-you-assigned' => 'صرف وہ اختیارات منتخب کی جا سکتی ہیں جو حساب کو فراہم کی گئی ہیں جب دوسرے صارفین کو بنایا یا ترتیب دیا جاتا ہے۔',

    'delete-this-subuser' => 'کیا آپ اس ذیلی صارف کو حذف کرنا چاہتے ہیں؟',
    'yes-remove' => 'جی ہاں، ذیلی صارف حذف کریں',
    'are-you-sure-to-remove' => 'کیا آپ یقینی ہیں کہ آپ اس ذیلی صارف کو ہٹانا چاہتے ہیں؟ انہیں فوراً اس سرور تک رسائی حاصل نہ ہو گی۔'
];
