<?php

return [
    'title' => 'उपयोगकर्ता',
    'manage-subusers' => 'उप-उपयोगकर्ता प्रबंधित करें',
    'new-user' => 'नया उपयोगकर्ता',

    'no-users' => 'ऐसा लगता है कि आपके पास कोई उप-उपयोगकर्ता नहीं है।',

    'name' => 'नाम',
    'email' => 'ईमेल',
    '2FA-enabled' => '2FA सक्षम है',
    'creation-date' => 'निर्माण तिथि',
    'modify-permissions' => 'अनुमतियाँ बदलें',

    'user-email' => 'उपयोगकर्ता ईमेल',
    'user-email-description' => 'इस सर्वर के लिए उप-उपयोगकर्ता के रूप में आमंत्रित किए जाने वाले उपयोगकर्ता का ईमेल दर्ज करें।',

    'select-all-permissions' => 'सभी अनुमतियाँ चुनें',
    'modify-permissions-for' => 'के लिए अनुमतियाँ बदलें',
    'view-permissions-for' => 'के लिए अनुमतियाँ देखें',
    'create-new-subuser' => 'नया उप-उपयोगकर्ता बनाएँ',
    'must-not-exceed' => 'ईमेल पता 191 अक्षरों से अधिक नहीं होना चाहिए।',
    'valid-email' => 'एक मान्य ईमेल पता प्रदान किया जाना चाहिए।',
    'save' => 'सहेजें',
    'invite-user' => 'उपयोगकर्ता को आमंत्रित करें',

    'only-permissions-you-assigned' => 'केवल वे अनुमतियाँ चुनी जा सकती हैं जो इस खाते को दी गई हैं जब अन्य उपयोगकर्ताओं को बनाया या संशोधित किया जाता है।',

    'delete-this-subuser' => 'क्या आप इस उप-उपयोगकर्ता को हटाना चाहते हैं?',
    'yes-remove' => 'हाँ, उप-उपयोगकर्ता हटाएँ',
    'are-you-sure-to-remove' => 'क्या आप सुनिश्चित हैं कि आप इस उप-उपयोगकर्ता को हटाना चाहते हैं? उन्हें तुरंत इस सर्वर तक पहुँच नहीं होगी।'
];
