<?php

return [
    'backups' => 'Резервні копії',
    'manage-backups' => 'Управління резервними копіями',
    'create-backup' => 'Створити резервну копію',
    'have-been-allocated' => '{{current}} з {{max}} резервних копій були створені для цього сервера.',

    'name' => 'Ім\'я',
    'size' => 'Розмір',
    'creation-date' => 'Дата створення',
    'checksum' => 'Контрольна сума',

    'failed' => 'Не вдалося',
    'continue' => 'Продовжити',

    'download' => 'Завантажити',
    'restore' => 'Відновити',
    'lock' => 'Заблокувати',
    'unlock' => 'Розблокувати',
    'delete' => 'Видалити',

    'limit-is-0' => 'Для цього сервера неможливо створювати резервні копії, оскільки ліміт резервних копій встановлений в 0.',
    'try-going-back' => 'Здається, у нас закінчились резервні копії для відображення, спробуйте повернутися на попередню сторінку.',
    'no-backups' => 'Схоже, в даний час для цього сервера немає збережених резервних копій.',
    'no-longer-protected' => 'Ця резервна копія більше не буде захищена від автоматичного або випадкового видалення.',
    'your-server-will-be-stopped' => 'Ваш сервер буде зупинено. Ви не зможете управляти його станом живлення, отримувати доступ до файлового менеджера або створювати додаткові резервні копії, поки операція не завершиться.',
    'delete-all-files' => 'Видалити всі файли перед відновленням резервної копії?',
    'permanent-operation' => 'Це постійна операція. Резервну копію буде неможливо відновити після видалення.',

    'create' => [
        'title' => 'Створити резервну копію сервера',
        'backup-name' => 'Ім\'я резервної копії',
        'backup-name-description' => 'При вказанні - ім\'я, яке слід використовувати для посилання на цю резервну копію.',
        'ignored-files-directories' => 'Ігноровані файли і каталоги',
        'ignored-files-directories-description' => 'Введіть файли або каталоги, які слід ігнорувати при створенні цієї резервної копії. Залиште поле порожнім, щоб використовувати вміст файлу .pteroignore в кореневому каталозі сервера, якщо він присутній. Підтримується шаблонне співставлення файлів і каталогів, а також відміна правила шляхом попереднього вказання шляху знаком оклику.',
        'locked' => 'Захищена',
        'locked-description' => 'Запобігає видаленню цієї резервної копії до явного розблокування.',
        'start' => 'Почати створення резервної копії',
    ]
];