<?php

return [
    'settings' => 'Налаштування',

    'sftp' => [
        'title' => 'Деталі SFTP',
        'server-address' => 'Адреса сервера',
        'username' => 'Ім\'я користувача',
        'description' => 'Ваш пароль SFTP такий самий, як пароль, який ви використовуєте для доступу до цієї панелі.',
        'launch-sftp' => 'Запустити SFTP',
    ],

    'rename' => [
        'title' => 'Змінити деталі сервера',
        'server-name' => 'Ім\'я сервера',
        'server-description' => 'Опис сервера',
        'save' => 'Зберегти',
    ],

    'debug' => [
        'title' => 'Відладкова інформація',
        'node' => 'Вузол',
        'server-id' => 'ID сервера',
    ],

    'reinstall' => [
        'title' => 'Перевстановлення сервера',
        'reinstall-started' => 'Ваш сервер розпочав процес перевстановлення.',
        'confirm-reinstallation' => 'Підтвердіть перевстановлення сервера',
        'yes-reinstall' => 'Так, перевстановити сервер',
        'are-you-sure' => 'Ваш сервер буде зупинено, і під час цього процесу деякі файли можуть бути видалені або змінені. Ви впевнені, що хочете продовжити?',
        'desc-1' => 'Перевстановлення сервера зупинить його, а потім повторно виконає сценарій встановлення, який спочатку налаштував його.',
        'desc-2' => 'Під час цього процесу деякі файли можуть бути видалені або змінені, будь ласка, зробіть резервну копію своїх даних перед продовженням.',
        'reinstall-server' => 'Перевстановити сервер',
    ],
];