<?php

return [
    'startup-settings' => 'Налаштування запуску',
    'startup-command' => 'Команда запуску',
    'docker-image' => 'Образ Docker',
    'read-only' => 'Тільки перегляд',
    'select-docker-feature' => 'Це продвинута функція, яка дозволяє вибрати Docker-образ для використання при запуску цього екземпляра сервера.',
    'custom-docker-image' => 'Цей Docker-образ сервера був встановлений вручну адміністратором і не може бути змінений через цей інтерфейс.',
    'variables' => 'Значення'
];
