<?php

return [
    'title' => 'Користувачі',
    'manage-subusers' => 'Управління підкористувачами',
    'new-user' => 'Новий користувач',

    'no-users' => 'Здається, у вас немає підкористувачів.',

    'name' => 'Ім\'я',
    'email' => 'Email',
    '2FA-enabled' => '2FA увімкнено',
    'creation-date' => 'Дата створення',
    'modify-permissions' => 'Змінити дозволи',

    'user-email' => 'Email користувача',
    'user-email-description' => 'Введіть адресу електронної пошти користувача, якого ви хочете запросити як підкористувача для цього сервера.',

    'modify-permissions-for' => 'Змінити дозволи для',
    'view-permissions-for' => 'Переглянути дозволи для',
    'create-new-subuser' => 'Створити нового підкористувача',
    'must-not-exceed' => 'Адреси електронної пошти не повинні перевищувати 191 символ.',
    'valid-email' => 'Необхідно вказати дійсну адресу електронної пошти.',
    'save' => 'Зберегти',
    'invite-user' => 'Запросити користувача',

    'only-permissions-you-assigned' => 'Можна вибирати тільки ті дозволи, які наразі назначені вашому обліковому запису при створенні або зміні інших користувачів.',

    'delete-this-subuser' => 'Видалити цього підкористувача?',
    'yes-remove' => 'Так, видалити підкористувача',
    'are-you-sure-to-remove' => 'Ви впевнені, що хочете видалити цього підкористувача? У нього негайно заберуть всі доступи до цього сервера.'
];