<?php

return[
    'backups' => 'بیک اپ',
    'manage-backups' => 'بیک اپ کا انتظام',
    'create-backup' => 'بیک اپ بنائیں',
    'have-been-allocated' => '{{current}} of {{max}} اس سرور کے لیے بیک اپ بنائے گئے ہیں۔.',

    'name' => 'نام',
    'size' => 'سائز',
    'creation-date' => 'تخلیق کی تاریخ',
    'checksum' => 'چیکسم',

    'failed' => 'ناکام',
    'continue' => 'جاری رہے',

    'download' => 'اسے ڈاؤن لوڈ کریں۔',
    'restore' => 'اسے بحال کرو',
    'lock' => 'بند کریں',
    'unlock' => 'انلاک',
    'delete' => 'انلاک',

    'limit-is-0' => 'اس سرور کے لیے بیک اپ نہیں بنائے جا سکتے کیونکہ بیک اپ کی حد مقرر ہے۔ 0.',
    'try-going-back' => 'Looks like we\'بیک اپ ختم ہو گئے ہیں، ایک صفحہ واپس جانے کی کوشش کریں۔',
    'no-backups' => 'ایسا لگتا ہے کہ اس سرور کے لیے فی الحال کوئی بیک اپ محفوظ نہیں ہے.',
    'no-longer-protected' => 'یہ بیک اپ اب خودکار یا حادثاتی طور پر حذف ہونے سے محفوظ نہیں رہے گا۔.',
    'your-server-will-be-stopped' => 'آپ کا سرور روک دیا جائے گا۔ آپ پاور اسٹیٹ کو کنٹرول کرنے، فائل مینیجر تک رسائی حاصل کرنے، یا مکمل ہونے تک اضافی بیک اپ بنانے کے قابل نہیں ہوں گے۔.',
    'delete-all-files' => 'بیک اپ بحال کرنے سے پہلے تمام فائلوں کو حذف کریں۔.',
    'permanent-operation' => 'یہ ایک مستقل آپریشن ہے۔ ایک بار حذف ہونے کے بعد بیک اپ بازیافت نہیں کیا جا سکتا.',

    'create' => [
        'title' => 'سرور بیک اپ بنائیں',
        'backup-name' => 'بیک اپ کا نام',
        'backup-name-description' => 'اگر فراہم کیا جائے تو وہ نام جو اس بیک اپ کا حوالہ دینے کے لیے استعمال کیا جانا چاہیے۔',
        'ignored-files-directories' => 'نظر انداز فائلیں اور ڈائریکٹریز',
        'ignored-files-directories-description' => 'اس بیک اپ کو تخلیق کرتے وقت نظر انداز کرنے کے لیے فائلز یا فولڈرز درج کریں۔ اگر موجود ہو تو سرور ڈائرکٹری کے روٹ میں .pteroignore فائل کے مواد کو استعمال کرنے کے لیے خالی چھوڑ دیں۔ فائلوں اور فولڈرز کی وائلڈ کارڈ کی مماثلت ایک فجائیہ کے ساتھ راستے کو پہلے سے طے کرکے اصول کی نفی کرنے کے علاوہ معاون ہے۔.',
        'locked' => 'بند',
        'locked-description' => 'واضح طور پر غیر مقفل ہونے تک اس بیک اپ کو حذف ہونے سے روکتا ہے۔',
        'start' => 'بیک اپ شروع کریں۔',
    ]
];
