<?php

return [
    'account-overview' => 'खाते का अवलोकन',
    'twofactor-messagebox' => 'जारी रखने के लिए आपके खाते पर दो-कारक प्रमाणीकरण सक्षम होना चाहिए।',
    'apikey' => 'API कुंजी',
    'sshkey' => 'SSH कुंजी',

    'update-password' => [
        'current' => 'वर्तमान पासवर्ड',
        'new' => 'नया पासवर्ड',
        'requirements' => 'आपका नया पासवर्ड कम से कम 8 अक्षरों का होना चाहिए और इस वेबसाइट के लिए विशिष्ट होना चाहिए।',
        'confirm' => 'नया पासवर्ड पुष्टि करें',
        'update' => 'पासवर्ड अपडेट करें',
    ],

    'update-email' => [
        'isUpdated' => 'आपका ईमेल सफलतापूर्वक अपडेट कर दिया गया है।',
        'update' => 'ईमेल अपडेट करें',
        'email' => 'ईमेल',
        'confirm' => 'पासवर्ड की पुष्टि करें',
    ],

    'appearance' => [
        'title' => 'दिखावट',
        'lightDarkMode' => 'लाइट / डार्क मोड',
        'light' => 'लाइट',
        'dark' => 'डार्क',
        'language' => 'पैनल भाषा',
        'panel-sounds' => 'पैनल ध्वनियाँ',
        'on' => 'चालू',
        'off' => 'बंद',

        'privacy-mode' => 'Privacy Mode',
    ],

    'twofactor' => [
        'title' => 'दो-कारक प्रमाणीकरण',
        'isEnabled' => 'आपके खाते पर वर्तमान में दो-कारक प्रमाणीकरण सक्षम है।',
        'isDisabled' => 'आपके खाते पर वर्तमान में दो-कारक प्रमाणीकरण सक्षम नहीं है। इसे सेट अप करने के लिए नीचे दिए गए बटन पर क्लिक करें।',
        'disable' => 'दो-कारक अक्षम करें',
        'enable' => 'दो-कारक सक्षम करें',
        
        'disable-dialog' => [
            'password' => 'पासवर्ड',
            'cancel' => 'रद्द करें',
            'must-enter-password' => 'जारी रखने के लिए आपको अपना खाता पासवर्ड दर्ज करना होगा।',
            'disable' => 'अक्षम करें',
        ],

        'setup-dialog' => [
            'description' => 'ऊपर दिखाए गए QR कोड को अपनी चुनी हुई दो-कारक प्रमाणीकरण ऐप से स्कैन करें। फिर, नीचे दिए गए फ़ील्ड में उत्पन्न 6-अंकों का कोड दर्ज करें।',
            'account-password' => 'खाता पासवर्ड',
            'qrcode-loading' => 'QR कोड लोड होने की प्रतीक्षा कर रहा है...',
            'enter-6digit-password' => 'जारी रखने के लिए आपको 6-अंकों का कोड और अपना पासवर्ड दर्ज करना होगा।',
            'enable' => 'सक्षम करें',
            'cancel' => 'रद्द करें',
        ],
    ],

    'apiKey' => [
        'label' => 'विवरण',
        'description' => 'इस API कुंजी का विवरण।',
        'allowedIPs-label' => 'अनुमत IPs',
        'allowedIPs-description' => 'किसी भी IP को इस API कुंजी का उपयोग करने की अनुमति देने के लिए इसे खाली छोड़ें, अन्यथा प्रत्येक IP को नई पंक्ति पर दर्ज करें।',
        'createButton' => 'बनाएँ',

        'your-keys' => 'आपकी API कुंजी',
        'store-save' => 'आपके अनुरोध की गई API कुंजी नीचे दिखाई गई है। कृपया इसे किसी सुरक्षित स्थान पर सहेजें, इसे बाद में फिर से नहीं दिखाया जाएगा।',
        'close' => 'बंद करें',

        'delete-api-key' => 'API कुंजी हटाएँ',
        'delete-key' => 'कुंजी हटाएँ',
        'all-requests-invalidated-1' => 'इस कुंजी का उपयोग करने वाली सभी',
        'all-requests-invalidated-2' => 'अनुरोध अमान्य कर दिए जाएँगे।',
        'loading' => 'लोड हो रहा है...',
        'no-key-found' => 'इस खाते के लिए कोई API कुंजियाँ नहीं मिलीं।',
        'last-used' => 'आखिरी बार उपयोग किया गया',
    ],

    'sshKey' => [
        'loading' => 'लोड हो रहा है...',
        'no-key-found' => 'इस खाते के लिए कोई SSH कुंजियाँ नहीं मिलीं।',
        'added-on' => 'जोड़ा गया',

        'createForm' => [
            'key-name' => 'SSH कुंजी का नाम',
            'public-key' => 'पब्लिक कुंजी',
            'public-key-desc' => 'अपनी पब्लिक SSH कुंजी दर्ज करें।',
            'save' => 'सहेजें',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'SSH कुंजी हटाएँ',
            'delete-key' => 'कुंजी हटाएँ',
            'will-invalidate-1' => 'इस',
            'will-invalidate-2' => 'SSH कुंजी को हटाने से इसका उपयोग पूरी तरह अमान्य हो जाएगा।',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'दो-कारक प्रमाणीकरण सक्षम है',
        'description' => 'नीचे दिए गए कोड को कहीं सुरक्षित स्थान पर रखें। यदि आप अपने फ़ोन तक पहुँच खो देते हैं तो आप इन बैकअप कोड का उपयोग साइन इन करने के लिए कर सकते हैं।',
        'alert' => 'ये कोड दोबारा नहीं दिखाए जाएँगे।',
        'doneButton' => 'हो गया',
    ],
];
