<?php

return [
    'account-overview' => 'اکاؤنٹ کا جائزہ',
    'twofactor-messagebox' => 'آپ کے اکاؤنٹ میں جاری رکھنے کے لیے دو-فیصد تصدیق کو چالو ہونا چاہئے۔',
    'apikey' => 'API کلید',
    'sshkey' => 'SSH کلید',

    'update-password' => [
        'current' => 'موجودہ پاسورڈ',
        'new' => 'نیا پاسورڈ',
        'requirements' => 'آپ کا نیا پاسورڈ کم سے کم 8 حروف کا ہونا چاہئے اور اس ویب سائٹ کے لیے یونیک ہونا چاہئے۔',
        'confirm' => 'نیا پاسورڈ کنفرم کریں',
        'update' => 'پاسورڈ اپ ڈیٹ کریں',
    ],

    'update-email' => [
        'isUpdated' => 'آپ کا مکمل ای میل اپ ڈیٹ ہوگیا ہے',
        'update' => 'ای میل اپ ڈیٹ کریں',
        'email' => 'ای میل',
        'confirm' => 'پاسورڈ کنفرم کریں',
    ],

    'appearance' => [
        'title' => 'ظاہریت',
        'lightDarkMode' => 'روشن/اندھیرے موڈ',
        'light' => 'روشن',
        'dark' => 'اندھیرا',
        'language' => 'پینل زبان',
        'panel-sounds' => 'پینل آوازیں',
        'on' => 'چالو',
        'off' => 'بند',
    ],

    'twofactor' => [
        'title' => 'دو-فیصد تصدیق',
        'isEnabled' => 'آپ کے اکاؤنٹ پر حال میں دو-فیصد تصدیق چالو ہے۔',
        'isDisabled' => 'آپ کے اکاؤنٹ پر حال میں دو-فیصد تصدیق چالو نہیں ہے۔ اسے تشکیل دینے کے لیے نیچے دیئے گئے بٹن پر کلک کریں۔',
        'disable' => 'دو-فیصد چھوڑیں',
        'enable' => 'دو-فیصد چالو کریں',
        
        'disable-dialog' => [
            'password' => 'پاسورڈ',
            'cancel' => 'منسوخ کریں',
            'must-enter-password' => 'آپ کو جاری رکھنے کے لیے اپنا اکاؤنٹ پاسورڈ درج کرنا ہوگا۔',
            'disable' => 'چھوڑیں',
        ],

        'setup-dialog' => [
            'description' => 'اوپر دیے گئے QR کوڈ کو آپ کی منتخب دو-فیصد تصدیق ایپ کے ذریعے اسکین کریں۔ پھر، نیچے دیے گئے فیلڈ میں بنائے گئے 6 ڈیجٹ کوڈ داخل کریں۔',
            'account-password' => 'اکاؤنٹ پاسورڈ',
            'qrcode-loading' => 'QR کوڈ لوڈ ہونے کا انتظار ہے...',
            'enter-6digit-password' => 'آپ کو جاری رکھنے کے لیے 6 ڈیجٹ کوڈ اور آپ کا پاسورڈ درج کرنا ہوگا۔',
            'enable' => 'چالو کریں',
            'cancel' => 'منسوخ کریں',
        ],
    ],

    'apiKey' => [
        'label' => 'تفصیل',
        'description' => 'اس API کلید کی تفصیل۔',
        'allowedIPs-label' => 'اجازت یافتہ IPs',
        'allowedIPs-description' => 'کسی بھی IP کو اس API کلید استعمال کرنے کی اجازت دینے کے لیے خالی چھوڑیں، بصورت دیگر ہر IP کو نئی لائن پر فراہم کریں۔',
        'createButton' => 'بنائیں',

        'your-keys' => 'آپ کی API کلید',
        'store-save' => 'آپ کی درخواست کی گئی API کلید نیچے دکھائی جاتی ہے۔ براہ کرم اسے ایک محفوظ جگہ پر محفوظ کریں، یہ دوبارہ ن',
        'close' => 'بند کریں',

        'delete-api-key' => 'API کلید ہٹائیں',
        'delete-key' => 'کلید ہٹائیں',
        'all-requests-invalidated-1' => 'تمام درخواستیں جو استعمال ہو رہی ہیں',
        'all-requests-invalidated-2' => 'کلید کا استعمال ناکارہ ہو جائے گا۔',
        'loading' => 'لوڈ ہو رہا ہے...',
        'no-key-found' => 'اس اکاؤنٹ کے لئے کوئی API کلیدیں موجود نہیں ہیں۔',
        'last-used' => 'آخری بار استعمال ہوا',
    ],

    'sshKey' => [
        'loading' => 'لوڈ ہو رہا ہے...',
        'no-key-found' => 'اس اکاؤنٹ کے لئے کوئی SSH کلیدیں موجود نہیں ہیں۔',
        'added-on' => 'شامل ہوا',

        'createForm' => [
            'key-name' => 'SSH کلید کا نام',
            'public-key' => 'عوامی کلید',
            'public-key-desc' => 'اپنی عوامی SSH کلید داخل کریں۔',
            'save' => 'محفوظ کریں',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'SSH کلید ہٹائیں',
            'delete-key' => 'کلید ہٹائیں',
            'will-invalidate-1' => 'کو',
            'will-invalidate-2' => 'SSH کلید ہٹانا اس کے استعمال کو پوری طرح ناکارہ بنا دے گا۔',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'دو-فیصد تصدیق چالو ہے',
        'description' => 'نیچے دیے گئے کوڈز کو کہیں محفوظ محفوظ رکھیں۔ اگر آپ اپنے فون کا رسالہ گم کر دیں تو آپ ان بیک اپ کو سائن ان کرنے کے لئے استعمال کرسکتے ہیں۔',
        'alert' => 'یہ کوڈز دوبارہ نہیں دکھائے جائیں گے۔',
        'doneButton' => 'ہوگیا',
    ],
];
