<?php

return [
    'support' => 'سپورٹ سینٹر',

    'login' => [
        'title' => 'جاری رہنے کے لیے لاگ ان کریں',
        'username-or-email' => 'صارف کا نام یا ای میل',
        'password' => 'پاسورڈ',
        'forgot-password' => 'پاسورڈ بھول گئے ہیں؟',
        'login' => 'لاگ ان',

        'must-be-provided' => 'ایک صارف کا نام یا ای میل فراہم کیا جانا چاہئے۔',
        'please-enter-password' => 'براہ کرم اپنا اکاؤنٹ پاسورڈ درج کریں',
    ],

    'forgot' => [
        'title' => 'پاسورڈ ری سیٹ کرنے کی درخواست',
        'email' => 'ای میل',
        'email-description' => 'پاسورڈ ری سیٹ کرنے کی ہدایتیں حاصل کرنے کے لیے اپنا اکاؤنٹ ای میل ایڈریس درج کریں۔',
        'send-email' => 'ای میل بھیجیں',
        'return-to-login' => 'لاگ ان پر واپس جائیں',

        'a-valid-email-provided' => 'جاری رہنے کے لئے ایک درست ای میل ایڈریس فراہم کیا جانا چاہئے۔',
    ],

    'device' => [
        'title' => 'ڈوائس چیکپوائنٹ',
        'recovery-code' => 'ریکوری کوڈ',
        'authentication-code' => 'تصدیقی کوڈ',

        'continue' => 'جاری رہنے دیں',

        'lost-device' => 'میرا ڈوائس گم ہوگیا ہے',
        'have-device' => 'میرے پاس ڈوائس ہے',

        'return-to-login' => 'لاگ ان پر واپس جائیں',

        'enter-one-of-recovery-codes' => 'جاری رہنے کے لئے اس اکاؤنٹ پر 2-فیصد تصدیق ترتیب دینے کے دوران جنریٹ ہونے والے ریکوری کوڈز میں سے ایک درج کریں۔',
        'enter-two-factor' => 'اپنے ڈوائس کے ذریعے جنریٹ ہونے والے دو-فیصد ٹوکن درج کریں',
    ],

    'reset' => [
        'title' => 'پاسورڈ دوبارہ ترتیب دیں',

        'email' => 'ای میل',
        'password' => 'پاسورڈ',
        'confirm-password' => 'نیا پاسورڈ کنفرم کریں',

        'return-to-login' => 'لاگ ان پر واپس جائیں',
        
        'password-required' => 'ایک نیا پاسورڈ درکار ہے۔',
        'at-least-8-characters' => 'آپ کا نیا پاسورڈ کم سے کم 8 حروف کا ہونا چاہئے۔',
        'password-does-not-match' => 'آپ کا نیا پاسورڈ میچ نہیں ہو رہا ہے۔',
    ]
];
