<?php

return [
    'startup-settings' => 'Настройки запуска',
    'startup-command' => 'Команда запуска',
    'docker-image' => 'Образ Docker',
    'read-only' => 'Только просмотр',
    'select-docker-feature' => 'Это продвинутая функция, которая позволяет выбрать Docker-образ для использования при запуске этого экземпляра сервера.',
    'custom-docker-image' => 'Этот Docker-образ сервера был установлен вручную администратором и не может быть изменен через этот интерфейс.',
    'variables' => 'Значения'
];
