<?php

return [
    'title' => 'Пользователи',
    'manage-subusers' => 'Управление подпользователями',
    'new-user' => 'Новый пользователь',

    'no-users' => 'Похоже, у вас нет подпользователей.',

    'name' => 'Имя',
    'email' => 'Email',
    '2FA-enabled' => '2FA включено',
    'creation-date' => 'Дата создания',
    'modify-permissions' => 'Изменить разрешения',

    'user-email' => 'Email пользователя',
    'user-email-description' => 'Введите адрес электронной почты пользователя, которого вы хотите пригласить в качестве подпользователя для этого сервера.',

    'modify-permissions-for' => 'Изменить разрешения для',
    'view-permissions-for' => 'Просмотреть разрешения для',
    'create-new-subuser' => 'Создать нового подпользователя',
    'must-not-exceed' => 'Адреса электронной почты не должны превышать 191 символ.',
    'valid-email' => 'Необходимо указать действительный адрес электронной почты.',
    'save' => 'Сохранить',
    'invite-user' => 'Пригласить пользователя',

    'only-permissions-you-assigned' => 'Можно выбирать только те разрешения, которые в данный момент назначены вашей учетной записи при создании или изменении других пользователей.',

    'delete-this-subuser' => 'Удалить этого подпользователя?',
    'yes-remove' => 'Да, удалить подпользователя',
    'are-you-sure-to-remove' => 'Вы уверены, что хотите удалить этого подпользователя? У него немедленно отберут все доступы к этому серверу.'
];
