<?php

return [
    'account-overview' => 'Обзор облікового запису',
    'twofactor-messagebox' => 'Для продовження необхідно увімкнути двофакторну аутентифікацію в вашому обліковому записі.',
    'apikey' => 'API-ключ',
    'sshkey' => 'SSH-ключ',

    'update-password' => [
        'current' => 'Поточний пароль',
        'new' => 'Новий пароль',
        'requirements' => 'Ваш новий пароль повинен містити принаймні 8 символів та бути унікальним для цього веб-сайту.',
        'confirm' => 'Підтвердіть новий пароль',
        'update' => 'Оновити пароль',
    ],

    'update-email' => [
        'isUpdated' => 'Ваш основний адреса електронної пошти був оновлений',
        'update' => 'Оновити адресу електронної пошти',
        'email' => 'Адреса електронної пошти',
        'confirm' => 'Підтвердіть пароль',
    ],

    'appearance' => [
        'title' => 'Зовнішній вигляд',
        'lightDarkMode' => 'Світлий/Темний режим',
        'light' => 'Світлий',
        'dark' => 'Темний',
        'language' => 'Мова панелі',
        'panel-sounds' => 'Звуки панелі',
        'on' => 'Увімкнено',
        'off' => 'Вимкнено',
    ],

    'twofactor' => [
        'title' => 'Двофакторна аутентифікація',
        'isEnabled' => 'Двохетапна перевірка в настоящий час увімкнена для вашого облікового запису.',
        'isDisabled' => 'На вашому обліковому записі в настоящий час не увімкнена двохетапна перевірка. Натисніть кнопку нижче, щоб почати налаштовування.',
        'disable' => 'Відключити',
        'enable' => 'Увімкнути',
        
        'disable-dialog' => [
            'password' => 'Пароль',
            'cancel' => 'Скасувати',
            'must-enter-password' => 'Ви повинні ввести пароль вашого облікового запису, щоб продовжити.',
            'disable' => 'Відключити',
        ],

        'setup-dialog' => [
            'description' => 'Отскануйте QR-код вище за допомогою додатка для двохфакторної аутентифікації на ваш вибір. Потім введіть згенерований код з 6 знаків у поле нижче.',
            'account-password' => 'Пароль облікового запису',
            'qrcode-loading' => 'Очікування завантаження QR-коду...',
            'enter-6digit-password' => 'Ви повинні ввести код з 6 знаків та пароль, щоб продовжити.',
            'enable' => 'Увімкнути',
            'cancel' => 'Скасувати',
        ],
    ],

    'apiKey' => [
        'label' => 'Опис',
        'description' => 'Опис цього API-ключа.',
        'allowedIPs-label' => 'Дозволені IP-адреси',
        'allowedIPs-description' => 'Залиште поле порожнім, щоб дозволити використання цього API-ключа будь-якому IP-адресі, в іншому випадку вкажіть кожен IP-адресу на новому рядку.',
        'createButton' => 'Створити',

        'your-keys' => 'Ваш API-ключ',
        'store-save' => 'Показаний вами API-ключ показано нижче. Збережіть його в безпечному місці, його більше не буде показано.',
        'close' => 'Закрити',

        'delete-api-key' => 'Видалити API-ключ',
        'delete-key' => 'Видалити ключ',
        'all-requests-invalidated-1' => 'Всі запити, використовуючи',
        'all-requests-invalidated-2' => 'ключ, будуть анульовані.',
        'loading' => 'Завантаження...',
        'no-key-found' => 'Для цього облікового запису немає API-ключів.',
        'last-used' => 'Останній використаний',
    ],

    'sshKey' => [
        'loading' => 'Завантаження...',
        'no-key-found' => 'Для цього облікового запису немає SSH-ключів.',
        'added-on' => 'Додано',

        'createForm' => [
            'key-name' => 'Ім\'я SSH-ключа',
            'public-key' => 'Публічний ключ',
            'public-key-desc' => 'Введіть ваш публічний SSH-ключ.',
            'save' => 'Зберегти',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'Видалити SSH-ключ',
            'delete-key' => 'Видалити ключ',
            'will-invalidate-1' => 'Видалення',
            'will-invalidate-2' => 'SSH-ключа анулює його використання в системі.',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'Двохетапна аутентифікація увімкнена',
        'description' => 'Збережіть коди нижче в надійному місці. Якщо ви втратите доступ до свого телефону, ви можете використовувати ці резервні коди для входу.',
        'alert' => 'Ці коди більше не будуть відображені.',
        'doneButton' => 'Готово',
    ],
];