<?php

return [
    'support' => 'Центр підтримки',

    'login' => [
        'title' => 'Увійдіть для продовження',
        'username-or-email' => 'Ім\'я користувача або електронна пошта',
        'password' => 'Пароль',
        'forgot-password' => 'Забули пароль?',
        'login' => 'Вхід',

        'must-be-provided' => 'Необхідно вказати ім\'я користувача або електронну пошту.',
        'please-enter-password' => 'Будь ласка, введіть пароль вашого облікового запису',
    ],

    'forgot' => [
        'title' => 'Запит на скидання пароля',
        'email' => 'Адреса електронної пошти',
        'email-description' => 'Введіть адресу електронної пошти вашого облікового запису, щоб отримати інструкції щодо скидання пароля.',
        'send-email' => 'Надіслати електронний лист',
        'return-to-login' => 'Повернутися до входу',

        'a-valid-email-provided' => 'Необхідно надати дійсну адресу електронної пошти для продовження.',
    ],

    'device' => [
        'title' => 'Двофакторна аутентифікація',
        'recovery-code' => 'Код відновлення',
        'authentication-code' => 'Код аутентифікації',

        'continue' => 'Продовжити',

        'lost-device' => 'Я втратив свій пристрій',
        'have-device' => 'У мене є пристрій',

        'return-to-login' => 'Повернутися до входу',

        'enter-one-of-recovery-codes' => 'Введіть один із кодів відновлення, згенерованих при налаштуванні двофакторної аутентифікації для цього облікового запису, щоб продовжити.',
        'enter-two-factor' => 'Введіть двофакторний токен, згенерований вашим пристроєм',
    ],

    'reset' => [
        'title' => 'Скидання пароля',

        'email' => 'Адреса електронної пошти',
        'password' => 'Пароль',
        'confirm-password' => 'Підтвердіть новий пароль',

        'return-to-login' => 'Повернутися до входу',
        
        'password-required' => 'Обов\'язково потрібен новий пароль.',
        'at-least-8-characters' => 'Ваш новий пароль повинен містити принаймні 8 символів.',
        'password-does-not-match' => 'Ваш новий пароль не співпадає.',
    ]
];
