<?php

return [
    'backups' => 'ਬੈਕਅੱਪਸ',
    'manage-backups' => 'ਬੈਕਅੱਪਸ ਪ੍ਰਬੰਧਨ',
    'create-backup' => 'ਬੈਕਅੱਪ ਬਣਾਓ',
    'have-been-allocated' => 'ਇਸ ਸਰਵਰ ਲਈ {{max}} ਬੈਕਅੱਪਸ ਵਿੱਚੋਂ {{current}} ਬੈਕਅੱਪਸ ਬਣਾਈ ਗਈ ਹਨ।',

    'name' => 'ਨਾਮ',
    'size' => 'ਆਕਾਰ',
    'creation-date' => 'ਸਰਜਨਾ ਮਿਤੀ',
    'checksum' => 'ਚੈੱਕਸਮ',

    'failed' => 'ਅਸਫਲ',
    'continue' => 'ਜਾਰੀ ਰੱਖੋ',

    'download' => 'ਡਾਉਨਲੋਡ',
    'restore' => 'ਮੁੜ-ਸਥਾਪਿਤ ਕਰੋ',
    'lock' => 'ਤਾਲਾ',
    'unlock' => 'ਅਨਲੌਕ',
    'delete' => 'ਮਿਟਾਓ',

    'limit-is-0' => 'ਇਸ ਸਰਵਰ ਲਈ ਬੈਕਅੱਪ ਸੀਮਾ 0 ਤੇ ਸੈਟ ਕੀਤਾ ਗਿਆ ਹੈ, ਇਸ ਲਈ ਬੈਕਅੱਪ ਨਹੀਂ ਬਣਾਈ ਜਾ ਸਕਦੀ।',
    'try-going-back' => 'ਸਾਡੀਆਂ ਤੁਹਾਡੇ ਨੂੰ ਦਿਖਾਉਣ ਲਈ ਕੋਈ ਬੈਕਅੱਪ ਨਹੀਂ ਹਨ, ਪੇਜ ਵਾਪਸ ਜਾਉ ਕੋਸ਼ਿਸ਼ ਕਰੋ।',
    'no-backups' => 'ਇਸ ਸਰਵਰ ਲਈ ਕੋਈ ਬੈਕਅੱਪ ਹਾਲੇ ਇੱਕ ਵੀ ਸਟੋਰ ਨਹੀਂ ਹਨ।',
    'no-longer-protected' => 'ਇਹ ਬੈਕਅੱਪ ਹੁਣ ਆਟੋਮੇਟਿਕ ਜਾਂ ਅਕਸ਼ਮਤ ਮਿਟਾਓ ਤੋਂ ਸੁਰੱਖਿਆ ਨਹੀਂ ਹੋਵੇਗੀ।',
    'your-server-will-be-stopped' => 'ਤੁਹਾਡਾ ਸਰਵਰ ਰੁਕਿਆ ਜਾਵੇਗਾ। ਤੁਸੀਂ ਵਾਧੂ ਅਧਿਕਾਰ, ਫਾਈਲ ਮੈਨੇਜਰ ਤੱਕ ਪਹੁੰਚ, ਜਾਂ ਵਾਧੂ ਬੈਕਅੱਪ ਬਣਾਉਣ ਦੇ ਕੰਟਰੋਲ ਨਹੀਂ ਕਰ ਸਕਦੇ ਹੋ ਜਦੋਂ ਤੱਕ ਕਿ ਇਸਨੂੰ ਪੂਰਾ ਨਹੀਂ ਕੀਤਾ ਗਿਆ ਹੈ।',
    'delete-all-files' => 'ਬੈਕਅੱਪ ਮੁੜ-ਸਥਾਪਿਤ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਸਭ ਫਾਈਲਾਂ ਮਿਟਾਓ।',
    'permanent-operation' => 'ਇਹ ਇੱਕ ਸਥਾਈ ਕਾਰਵਾਈ ਹੈ। ਬੈਕਅੱਪ ਇਕ ਵਾਰ ਮਿਟਾਈ ਗਈ ਹੋਣ ਦਾ ਵੀਆਰਾ ਨਹੀਂ ਹੋ ਸਕਦਾ।',

    'create' => [
        'title' => 'ਸਰਵਰ ਬੈਕਅੱਪ ਬਣਾਓ',
        'backup-name' => 'ਬੈਕਅੱਪ ਦਾ ਨਾਮ',
        'backup-name-description' => 'ਜੇ ਦਿੱਤਾ ਗਿਆ, ਤਾਂ ਇਸ ਬੈਕਅੱਪ ਨੂੰ ਸੰਦਰਭਿਤ ਕਰਨ ਲਈ ਵਰਤਣਯੋਗ ਨਾਮ।',
        'ignored-files-directories' => 'ਅਣਧਾਰਿਤ ਫਾਈਲਾਂ ਅਤੇ ਡਾਇਰੈਕਟਰੀਆਂ',
        'ignored-files-directories-description' => 'ਇਸ ਬੈਕਅੱਪ ਨੂੰ ਬਣਾਉਣ ਲਈ ਅਣਧਾਰਿਤ ਫਾਈਲਾਂ ਜਾਂ ਡਾਇਰੈਕਟਰੀਆਂ ਦਾਖਲ ਕਰੋ। ਜੇ ਹਾਜ਼ਰ ਹੈ, ਤਾਂ ਸਰਵਰ ਡਾਇਰੈਕਟਰੀ ਦੇ ਰੂਟ ਵਿੱਚ .pteroignore ਫਾਈਲ ਦੀ ਸਮਗਰੀ ਵਰਤਣੀ ਜਾਵੇਗੀ। ਫਾਈਲਾਂ ਅਤੇ ਡਾਇਰੈਕਟਰੀਆਂ ਲਈ ਵਾਈਲਡਕਾਰਡ ਮੈਚਿੰਗ ਸਮਰਥ ਹੈ ਅਤੇ ਇਕ ਨਿਯਮ ਦੀ ਪ੍ਰਥਾਂਗਤਾ ਨਾਲ ਰਾਹਤ ਦੇਣ ਲਈ ਰਾਹਤ ਦੇਣ ਲਈ ਰੂਟ ਰੂਟ ਦੀ ਪਥ ਨੂੰ ਨਾਲ ਵਿਆਖਿਆ ਕਰੋ।',
        'locked' => 'ਤਾਲਾ ਲਗਾਇਆ ਗਿਆ ਹੈ',
        'locked-description' => 'ਇਸ ਬੈਕਅੱਪ ਨੂੰ ਖੋਲਣ ਤੋਂ ਪਹਿਲਾਂ ਮਿਟਾਉਣ ਨਾਲ ਰੋਕੋ।',
        'start' => 'ਬੈਕਅੱਪ ਸ਼ੁਰੂ ਕਰੋ',
    ]
];
