<?php

return [
    'settings' => 'ਸੈਟਿੰਗਾਂ',

    'sftp' => [
        'title' => 'SFTP ਵੇਰਵਾ',
        'server-address' => 'ਸਰਵਰ ਪਤਾ',
        'username' => 'ਯੂਜ਼ਰਨਾਮ',
        'description' => 'ਤੁਹਾਡਾ SFTP ਪਾਸਵਰਡ ਇਸ ਪੈਨਲ ਤੱਕ ਪਹੁੰਚ ਲਈ ਵਰਤੇ ਗਏ ਪਾਸਵਰਡ ਨਾਲ ਸਮਾਨ ਹੈ।',
        'launch-sftp' => 'SFTP ਲਾਂਚ ਕਰੋ',
    ],

    'rename' => [
        'title' => 'ਸਰਵਰ ਵੇਰਵਾ ਬਦਲੋ',
        'server-name' => 'ਸਰਵਰ ਨਾਮ',
        'server-description' => 'ਸਰਵਰ ਵੇਰਵਾ',
        'save' => 'ਸੰਭਾਲੋ',
    ],

    'debug' => [
        'title' => 'ਡੀਬੱਗ ਜਾਣਕਾਰੀ',
        'node' => 'ਨੋਡ',
        'server-id' => 'ਸਰਵਰ ਆਈਡੀ',
    ],

    'reinstall' => [
        'title' => 'ਸਰਵਰ ਮੁੜ ਇੰਸਟਾਲ ਕਰੋ',
        'reinstall-started' => 'ਤੁਹਾਡਾ ਸਰਵਰ ਮੁੜ ਇੰਸਟਾਲੇਸ਼ਨ ਪ੍ਰਕਿਰਿਆ ਸ਼ੁਰੂ ਹੋ ਗਈ ਹੈ।',
        'confirm-reinstallation' => 'ਸਰਵਰ ਮੁੜ ਇੰਸਟਾਲੇਸ਼ਨ ਦੀ ਪੁਸ਼ਟੀ ਕਰੋ',
        'yes-reinstall' => 'ਹਾਂ, ਸਰਵਰ ਮੁੜ ਇੰਸਟਾਲ ਕਰੋ',
        'are-you-sure' => 'ਤੁਹਾਡਾ ਸਰਵਰ ਬੰਦ ਹੋ ਜਾਵੇਗਾ ਅਤੇ ਇਸ ਪ੍ਰਕਿਰਿਆ ਦੌਰਾਨ ਕੁਝ ਫਾਈਲਾਂ ਮਿਟ ਸਕਦੀਆਂ ਹਨ ਜਾਂ ਸੋਧੀਆਂ ਜਾ ਸਕਦੀਆਂ ਹਨ, ਕੀ ਤੁਸੀਂ ਇਸ ਪ੍ਰਕਿਰਿਆ ਨੂੰ ਜਾਰੀ ਰੱਖਣਾ ਚਾਹੁੰਦੇ ਹੋ?',
        'desc-1' => 'ਆਪਣੇ ਸਰਵਰ ਦੀ ਮੁੜ ਇੰਸਟਾਲੇਸ਼ਨ ਕਰਨ ਨਾਲ ਇਹ ਰੁਕ ਜਾਵੇਗਾ ਅਤੇ ਫਿਰ ਉਸ ਨੂੰ ਸ਼ੁਰੂ ਕਰਨ ਲਈ ਇੱਸ ਦੀ ਪੁੱਛੇਗਾ ਜਾਵੇਗਾ ਜਿਸ ਨੇ ਉਸ ਨੂੰ ਪਹਿਲਾਂ ਸੈੱਟ ਕੀਤਾ ਸੀ।',
        'desc-2' => 'ਇਸ ਪ੍ਰਕਿਰਿਆ ਦੌਰਾਨ ਕੁਝ ਫਾਈਲਾਂ ਮਿਟ ਜਾਣਗੀਆਂ ਜਾਂ ਸੋਧੀਆਂ ਜਾਣਗੀਆਂ ਹਨ, ਕਿਰਪਾ ਕਰਕੇ ਜਾਰੀ ਰੱਖਣ ਤੋਂ ਪਹਿਲਾਂ ਆਪਣੇ ਡਾਟਾ ਦੀ ਬੈਕਅੱਪ ਬਣਾਓ।',
        'reinstall-server' => 'ਸਰਵਰ ਮੁੜ ਇੰਸਟਾਲ ਕਰੋ',
    ],
];
